[{"id":"68033","name":"Baldur's Gate 3","description":"An ancient evil has returned to Baldur's Gate, intent on devouring it from the inside out. The fate of Faerun lies in your hands. Alone, you may resist. But together, you can overcome.How long is Baldur's Gate 3? When focusing on the main objectives, Baldur's Gate 3 is about 61½ Hours in length. If you're a gamer that strives to see all aspects of the game, you are likely to spend around 150 Hours to obtain 100% completion.","platforms":["Mac","PC","PlayStation 5","Xbox Series X/S"],"imageUrl":"https://howlongtobeat.com/games/68033_Baldurs_Gate_3.jpg?width=760","timeLabels":[["gameplayMain","Main Story"],["gameplayMainExtra","Main + Sides"],["gameplayComplete","Completionist"]],"gameplayMain":61.5,"gameplayMainExtra":106,"gameplayCompletionist":150,"similarity":1,"searchTerm":"Baldur's Gate 3","playableOn":["Mac","PC","PlayStation 5","Xbox Series X/S"]},{"id":"2127","name":"Cyberpunk 2077","description":"Cyberpunk 2077 is an open-world, action-adventure story set in Night City, a megalopolis obsessed with power, glamour and body modification. You play as V, a mercenary outlaw going after a one-of-a-kind implant that is the key to immortality.How long is Cyberpunk 2077? When focusing on the main objectives, Cyberpunk 2077 is about 25 Hours in length. If you're a gamer that strives to see all aspects of the game, you are likely to spend around 104 Hours to obtain 100% completion.Platforms: Google Stadia, PC, PlayStation 4, PlayStation 5, Xbox One, Xbox Series X/S","platforms":["Google Stadia","PC","PlayStation 4","PlayStation 5","Xbox One","Xbox Series X/S"],"imageUrl":"https://howlongtobeat.com/games/Cyberpunk-2077-2.jpg?width=760","timeLabels":[["gameplayMain","Main Story"],["gameplayMainExtra","Main + Sides"],["gameplayComplete","Completionist"]],"gameplayMain":25,"gameplayMainExtra":61,"gameplayCompletionist":104,"similarity":1,"searchTerm":"Cyberpunk 2077","playableOn":["Google Stadia","PC","PlayStation 4","PlayStation 5","Xbox One","Xbox Series X/S"]},{"id":"27100","name":"Red Dead Redemption 2","description":"Red Dead Redemption 2 is an epic tale of life in America's unforgiving heartland. The game's vast and atmospheric world will also provide the foundation for a brand new online multiplayer experience.How long is Red Dead Redemption 2? When focusing on the main objectives, Red Dead Redemption 2 is about 50 Hours in length. If you're a gamer that strives to see all aspects of the game, you are likely to spend around 183 Hours to obtain 100% completion.Genres: First-Person, Third-Person, Action, Adventure, Open World, Shooter","platforms":["Google Stadia","PC","PlayStation 4","Xbox One"],"imageUrl":"https://howlongtobeat.com/games/27100_Red_Dead_Redemption_2.jpg?width=760","timeLabels":[["gameplayMain","Main Story"],["gameplayMainExtra","Main + Sides"],["gameplayComplete","Completionist"]],"gameplayMain":50,"gameplayMainExtra":82,"gameplayCompletionist":183,"similarity":1,"searchTerm":"Red Dead Redemption 2","playableOn":["Google Stadia","PC","PlayStation 4","Xbox One"]},{"id":"4064","name":"Grand Theft Auto V","description":"Developed by series creator Rockstar North, Grand Theft Auto V is the largest and most ambitious title in the series to date. Set in the sprawling city of Los Santos and the surrounding area, Grand Theft Auto V delivers a world of unprecedented scale and detail bursting with life, from mountaintops to the depths of the ocean.How long is Grand Theft Auto V? When focusing on the main objectives, Grand Theft Auto V is about 32 Hours in length. If you're a gamer that strives to see all aspects of the game, you are likely to spend around 83½ Hours to obtain 100% completion.Platforms: PC, PlayStation 3, PlayStation 4, PlayStation 5, Xbox 360, Xbox One, Xbox Series X/SGenres: First-Person, Third-Person, Action, Open World, Racing/Driving, Shooter","platforms":["PC","PlayStation 3","PlayStation 4","PlayStation 5","Xbox 360","Xbox One","Xbox Series X/S"],"imageUrl":"https://howlongtobeat.com/games/4064_Grand_Theft_Auto_V.jpg?width=760","timeLabels":[["gameplayMain","Main Story"],["gameplayMainExtra","Main + Sides"],["gameplayComplete","Completionist"]],"gameplayMain":32,"gameplayMainExtra":50,"gameplayCompletionist":83.5,"similarity":1,"searchTerm":"Grand Theft Auto V","playableOn":["PC","PlayStation 3","PlayStation 4","PlayStation 5","Xbox 360","Xbox One","Xbox Series X/S"]},{"id":"7231","name":"Portal 2","description":"Portal 2 draws from the award-winning formula of innovative gameplay, story, and music that earned the original Portal over 70 industry accolades and created a cult following.\n\nThe single-player portion of Portal 2 introduces a cast of dynamic new characters, a host of fresh puzzle elements, and a much larger set of devious test chambers. Players ...Read More will explore never-before-seen areas of the Aperture Science Labs and be reunited with GLaDOS, the occasionally murderous computer companion who guided them through the original game.\n\nThe game’s two-player cooperative mode features its own entirely separate campaign with a unique story, test chambers, and two new player characters. This new mode forces players to reconsider everything they thought they knew about portals. Success will require them to not just act cooperatively, but to think cooperatively. How long is Portal 2? When focusing on the main objectives, Portal 2 is about 8½ Hours in length. If you're a gamer that strives to see all aspects of the game, you are likely to spend around 21½ Hours to obtain 100% completion.","platforms":["Linux","Mac","Nintendo Switch","PC","PlayStation 3","Xbox 360"],"imageUrl":"https://howlongtobeat.com/games/Portal2cover.jpg?width=760","timeLabels":[["gameplayMain","Main Story"],["gameplayMainExtra","Main + Sides"],["gameplayComplete","Completionist"]],"gameplayMain":8.5,"gameplayMainExtra":13.5,"gameplayCompletionist":21.5,"similarity":1,"searchTerm":"Portal 2","playableOn":["Linux","Mac","Nintendo Switch","PC","PlayStation 3","Xbox 360"]},{"id":"68151","name":"Elden Ring","description":"The Golden Order has been broken. Rise, Tarnished, and be guided by grace to brandish the power of the Elden Ring and become an Elden Lord in the Lands Between. In the Lands Between ruled by Queen Marika the Eternal, the Elden Ring, the source of the Erdtree, has been shattered. Marika's offspring, demigods all, claimed the shards of the Elden Ring ...Read More known as the Great Runes, and the mad taint of their newfound strength triggered a war: The Shattering. A war that meant abandonment by the Greater Will. And now the guidance of grace will be brought to the Tarnished who were spurned by the grace of gold and exiled from the Lands Between. Ye dead who yet live, your grace long lost, follow the path to the Lands Between beyond the foggy sea to stand before the Elden Ring. And become the Elden Lord. How long is Elden Ring? When focusing on the main objectives, Elden Ring is about 58½ Hours in length. If you're a gamer that strives to see all aspects of the game, you are likely to spend around 133 Hours to obtain 100% completion.","platforms":["PC","PlayStation 4","PlayStation 5","Xbox One","Xbox Series X/S"],"imageUrl":"https://howlongtobeat.com/games/68151_Elden_Ring.jpg?width=760","timeLabels":[["gameplayMain","Main Story"],["gameplayMainExtra","Main + Sides"],["gameplayComplete","Completionist"]],"gameplayMain":58.5,"gameplayMainExtra":100,"gameplayCompletionist":133,"similarity":1,"searchTerm":"Elden Ring","playableOn":["PC","PlayStation 4","PlayStation 5","Xbox One","Xbox Series X/S"]},{"id":"7230","name":"Portal","description":"Portal is a new single player game from Valve, creators of Half-Life 2 and Counter-Strike. Set in the mysterious Aperture Science Laboratories, Portal has earned over 15 Game of the Year Awards and offers gamers hours of unique gameplay. The game is designed to change the way players approach, manipulate and surmise the possibilities in a given env ...Read Moreironment; similar to how Half-Life 2's Gravity Gun innovated new ways to leverage an object in any given situation. Players must solve physical puzzles and challenges by opening portals to maneuvering objects, and themselves, through space. How long is Portal? When focusing on the main objectives, Portal is about 3 Hours in length. If you're a gamer that strives to see all aspects of the game, you are likely to spend around 10 Hours to obtain 100% completion.","platforms":["Linux","Mac","Nintendo Switch","PC","PlayStation 3","Xbox 360"],"imageUrl":"https://howlongtobeat.com/games/256px-Portal_standalonebox.jpg?width=760","timeLabels":[["gameplayMain","Main Story"],["gameplayMainExtra","Main + Sides"],["gameplayComplete","Completionist"]],"gameplayMain":3,"gameplayMainExtra":5,"gameplayCompletionist":10,"similarity":1,"searchTerm":"Portal","playableOn":["Linux","Mac","Nintendo Switch","PC","PlayStation 3","Xbox 360"]},{"id":"10270","name":"The Witcher 3: Wild Hunt","description":"In The Witcher 3 an ancient evil stirs, awakening. An evil that sows terror and abducts the young. An evil whose name is spoken only in whispers: the Wild Hunt. Led by four wraith commanders, this ravenous band of phantoms is the ultimate predator and has been for centuries. Its quarry: humans.How long is The Witcher 3: Wild Hunt? When focusing on the main objectives, The Witcher 3: Wild Hunt is about 51½ Hours in length. If you're a gamer that strives to see all aspects of the game, you are likely to spend around 173 Hours to obtain 100% completion.Platforms: Nintendo Switch, PC, PlayStation 4, PlayStation 5, Xbox One, Xbox Series X/S","platforms":["Nintendo Switch","PC","PlayStation 4","PlayStation 5","Xbox One","Xbox Series X/S"],"imageUrl":"https://howlongtobeat.com/games/10270_The_Witcher_3_Wild_Hunt.jpg?width=760","timeLabels":[["gameplayMain","Main Story"],["gameplayMainExtra","Main + Sides"],["gameplayComplete","Completionist"]],"gameplayMain":51.5,"gameplayMainExtra":103,"gameplayCompletionist":173,"similarity":1,"searchTerm":"The Witcher 3: Wild Hunt","playableOn":["Nintendo Switch","PC","PlayStation 4","PlayStation 5","Xbox One","Xbox Series X/S"]},{"id":"26286","name":"Hollow Knight","description":"Hollow Knight is a challenging, beautiful action adventure game set in the vast, inter-connected underground kingdom of Hallownest. A 2D action game with an emphasis on skill and exploration, Hollow Knight has you fighting a fearsome host of deadly creatures, avoiding intricate traps and solving ancient mysteries as you make your own way through fu ...Read Morengal wastes, forests of bone, and ruined underground cities. How long is Hollow Knight? When focusing on the main objectives, Hollow Knight is about 27 Hours in length. If you're a gamer that strives to see all aspects of the game, you are likely to spend around 63 Hours to obtain 100% completion.","platforms":["Linux","Mac","Nintendo Switch","PC","PlayStation 4","Xbox One"],"imageUrl":"https://howlongtobeat.com/games/Hollow_Knight_collection_branding.jpg?width=760","timeLabels":[["gameplayMain","Main Story"],["gameplayMainExtra","Main + Sides"],["gameplayComplete","Completionist"]],"gameplayMain":27,"gameplayMainExtra":41.5,"gameplayCompletionist":63,"similarity":1,"searchTerm":"Hollow Knight","playableOn":["Linux","Mac","Nintendo Switch","PC","PlayStation 4","Xbox One"]},{"id":"10469","name":"Tomb Raider","description":"After a brutal storm destroys the boat she was travelling on, a frightened young woman is left washed ashore on an unknown beach. On her own but not alone she has only one goal, to survive. Here begins the first adventure for a young and inexperienced Lara Croft in a story which charts the journey of an ordinary woman who finds out just how far she ...Read More must go in order to stay alive. How long is Tomb Raider? When focusing on the main objectives, Tomb Raider is about 11½ Hours in length. If you're a gamer that strives to see all aspects of the game, you are likely to spend around 21 Hours to obtain 100% completion.Platforms: Google Stadia, Linux, Mac, PC, PlayStation 3, PlayStation 4, Xbox 360, Xbox OneDevelopers: Crystal Dynamics, Eidos Montreal, Nixxes Software BV, United Front Games","platforms":["Google Stadia","Linux","Mac","PC","PlayStation 3","PlayStation 4","Xbox 360","Xbox One"],"imageUrl":"https://howlongtobeat.com/games/256px-Tr2011cover.jpg?width=760","timeLabels":[["gameplayMain","Main Story"],["gameplayMainExtra","Main + Sides"],["gameplayComplete","Completionist"]],"gameplayMain":11.5,"gameplayMainExtra":15.5,"gameplayCompletionist":21,"similarity":1,"searchTerm":"Tomb Raider","playableOn":["Google Stadia","Linux","Mac","PC","PlayStation 3","PlayStation 4","Xbox 360","Xbox One"]},{"id":"38050","name":"God of War","description":"His vengeance against the Gods of Olympus years behind him, Kratos now lives as a man in the realm of Norse Gods and monsters. It is in this harsh, unforgiving world that he must fight to survive… and teach his son to do the same.How long is God of War? When focusing on the main objectives, God of War is about 20½ Hours in length. If you're a gamer that strives to see all aspects of the game, you are likely to spend around 51 Hours to obtain 100% completion.","platforms":["PC","PlayStation 4"],"imageUrl":"https://howlongtobeat.com/games/38050_God_of_War.jpg?width=760","timeLabels":[["gameplayMain","Main Story"],["gameplayMainExtra","Main + Sides"],["gameplayComplete","Completionist"]],"gameplayMain":20.5,"gameplayMainExtra":33,"gameplayCompletionist":51,"similarity":1,"searchTerm":"God of War","playableOn":["PC","PlayStation 4"]},{"id":"62941","name":"Hades","description":"Defy the god of death as you hack and slash your way out of the Underworld in this rogue-like dungeon crawler from the creators of Bastion and Transistor.How long is Hades? When focusing on the main objectives, Hades is about 23 Hours in length. If you're a gamer that strives to see all aspects of the game, you are likely to spend around 95½ Hours to obtain 100% completion.Platforms: Mac, Nintendo Switch, PC, PlayStation 4, PlayStation 5, Xbox One, Xbox Series X/S","platforms":["Mac","Nintendo Switch","PC","PlayStation 4","PlayStation 5","Xbox One","Xbox Series X/S"],"imageUrl":"https://howlongtobeat.com/games/62941_Hades.jpg?width=760","timeLabels":[["gameplayMain","Main Story"],["gameplayMainExtra","Main + Sides"],["gameplayComplete","Completionist"]],"gameplayMain":23,"gameplayMainExtra":48.5,"gameplayCompletionist":95.5,"similarity":1,"searchTerm":"Hades","playableOn":["Mac","Nintendo Switch","PC","PlayStation 4","PlayStation 5","Xbox One","Xbox Series X/S"]},{"id":"83145","name":"Hogwarts Legacy","description":"Experience Hogwarts in the 1800s. Your character is a student who holds the key to an ancient secret that threatens to tear the wizarding world apart. Make allies, battle Dark wizards and decide the fate of the wizarding world.How long is Hogwarts Legacy? When focusing on the main objectives, Hogwarts Legacy is about 26½ Hours in length. If you're a gamer that strives to see all aspects of the game, you are likely to spend around 68 Hours to obtain 100% completion.Platforms: Nintendo Switch, PC, PlayStation 4, PlayStation 5, Xbox One, Xbox Series X/S","platforms":["Nintendo Switch","PC","PlayStation 4","PlayStation 5","Xbox One","Xbox Series X/S"],"imageUrl":"https://howlongtobeat.com/games/83145_Hogwarts_Legacy.jpg?width=760","timeLabels":[["gameplayMain","Main Story"],["gameplayMainExtra","Main + Sides"],["gameplayComplete","Completionist"]],"gameplayMain":26.5,"gameplayMainExtra":44,"gameplayCompletionist":68,"similarity":1,"searchTerm":"Hogwarts Legacy","playableOn":["Nintendo Switch","PC","PlayStation 4","PlayStation 5","Xbox One","Xbox Series X/S"]},{"id":"1065","name":"BioShock","description":"BioShock is a shooter unlike any you've ever played, loaded with weapons and tactics never seen. You'll have a complete arsenal at your disposal from simple revolvers to grenade launchers and chemical throwers, but you'll also be forced to genetically modify your DNA to create an even more deadly weapon: you. Injectable plasmids give you super huma ...Read Moren powers: blast electrical currents into water to electrocute multiple enemies, or freeze them solid and obliterate them with the swing of a wrench.\n\nNo encounter ever plays out the same, and no two gamers will play the game the same way. How long is BioShock? When focusing on the main objectives, BioShock is about 12 Hours in length. If you're a gamer that strives to see all aspects of the game, you are likely to spend around 22½ Hours to obtain 100% completion.Platforms: Mobile, Nintendo Switch, OnLive, PC, PlayStation 3, PlayStation 4, Xbox 360, Xbox One","platforms":["Mobile","Nintendo Switch","OnLive","PC","PlayStation 3","PlayStation 4","Xbox 360","Xbox One"],"imageUrl":"https://howlongtobeat.com/games/Bioshockcoverfinalcropped.jpg?width=760","timeLabels":[["gameplayMain","Main Story"],["gameplayMainExtra","Main + Sides"],["gameplayComplete","Completionist"]],"gameplayMain":12,"gameplayMainExtra":15.5,"gameplayCompletionist":22.5,"similarity":1,"searchTerm":"BioShock","playableOn":["Mobile","Nintendo Switch","OnLive","PC","PlayStation 3","PlayStation 4","Xbox 360","Xbox One"]},{"id":"72589","name":"The Legend of Zelda: Tears of the Kingdom","description":"An epic adventure across the land and skies of Hyrule awaits in The Legend of Zelda: Tears of the Kingdom for Nintendo Switch. The adventure is yours to create in a world fueled by your imagination. In this sequel to The Legend of Zelda: Breath of the Wild, you’ll decide your own path through the sprawling landscapes of Hyrule and the mysterious is ...Read Morelands floating in the vast skies above. Can you harness the power of Link’s new abilities to fight back against the malevolent forces that threaten the kingdom? How long is The Legend of Zelda: Tears of the Kingdom? When focusing on the main objectives, The Legend of Zelda: Tears of the Kingdom is about 59 Hours in length. If you're a gamer that strives to see all aspects of the game, you are likely to spend around 241 Hours to obtain 100% completion.","platforms":[],"imageUrl":"https://howlongtobeat.com/games/72589_The_Legend_of_Zelda_Tears_of_the_Kingdom.jpg?width=760","timeLabels":[["gameplayMain","Main Story"],["gameplayMainExtra","Main + Sides"],["gameplayComplete","Completionist"]],"gameplayMain":59,"gameplayMainExtra":115,"gameplayCompletionist":241,"similarity":1,"searchTerm":"The Legend of Zelda: Tears of the Kingdom","playableOn":[]},{"id":"1068","name":"BioShock Infinite","description":"BioShock Infinite is a first-person shooter like you've never seen. Set in 1912, players assume the role of former Pinkerton agent Booker DeWitt, sent to the flying city of Columbia on a rescue mission. His target? Elizabeth, imprisoned since childhood. During their daring escape, Booker and Elizabeth form a powerful bond -- one that lets Booker au ...Read Moregment his own abilities with her world-altering control over the environment. Together, they fight from high-speed Sky-Lines, in the streets and houses of Columbia, on giant zeppelins, and in the clouds, all while learning to harness an expanding arsenal of weapons and abilities, and immersing players in a story that is not only steeped in profound thrills and surprises, but also invests its characters with deep emotional bonds. How long is BioShock Infinite? When focusing on the main objectives, BioShock Infinite is about 11½ Hours in length. If you're a gamer that strives to see all aspects of the game, you are likely to spend around 28 Hours to obtain 100% completion.Platforms: PC, Nintendo Switch, PlayStation 3, PlayStation 4, Xbox 360, Xbox One","platforms":["PC","Nintendo Switch","PlayStation 3","PlayStation 4","Xbox 360","Xbox One"],"imageUrl":"https://howlongtobeat.com/games/Official_cover_art_for_Bioshock_Infinite.jpg?width=760","timeLabels":[["gameplayMain","Main Story"],["gameplayMainExtra","Main + Sides"],["gameplayComplete","Completionist"]],"gameplayMain":11.5,"gameplayMainExtra":16,"gameplayCompletionist":28,"similarity":1,"searchTerm":"BioShock Infinite","playableOn":["PC","Nintendo Switch","PlayStation 3","PlayStation 4","Xbox 360","Xbox One"]},{"id":"130444","name":"Super Mario Bros. Wonder","description":"Mario and friends have been invited to visit the colorful Flower Kingdom, just a short hop away from the Mushroom Kingdom. Unfortunately, King Bowser has transformed into a flying castle and is causing chaos across their peaceful land. Now our heroes must save the day and the Flower Kingdom in this wondrous new adventure!How long is Super Mario Bros. Wonder? When focusing on the main objectives, Super Mario Bros. Wonder is about 10 Hours in length. If you're a gamer that strives to see all aspects of the game, you are likely to spend around 19 Hours to obtain 100% completion.","platforms":[],"imageUrl":"https://howlongtobeat.com/games/130444_Super_Mario_Bros_Wonder.jpg?width=760","timeLabels":[["gameplayMain","Main Story"],["gameplayMainExtra","Main + Sides"],["gameplayComplete","Completionist"]],"gameplayMain":10,"gameplayMainExtra":13,"gameplayCompletionist":19,"similarity":1,"searchTerm":"Super Mario Bros. Wonder","playableOn":[]},{"id":"57479","name":"Resident Evil 2","description":"A deadly virus engulfs the residents of Raccoon City in September of 1998, plunging the city into chaos as flesh eating zombies roam the streets for survivors. An unparalleled adrenaline rush, gripping storyline, and unimaginable horrors await you. Witness the return of Resident Evil 2.How long is Resident Evil 2? When focusing on the main objectives, Resident Evil 2 is about 8½ Hours in length. If you're a gamer that strives to see all aspects of the game, you are likely to spend around 35 Hours to obtain 100% completion.Platforms: Amazon Luna, Nintendo Switch, PC, PlayStation 4, PlayStation 5, Xbox One, Xbox Series X/S","platforms":["Amazon Luna","Nintendo Switch","PC","PlayStation 4","PlayStation 5","Xbox One","Xbox Series X/S"],"imageUrl":"https://howlongtobeat.com/games/57479_Resident_Evil_2_(2019).jpg?width=760","timeLabels":[["gameplayMain","Main Story"],["gameplayMainExtra","Main + Sides"],["gameplayComplete","Completionist"]],"gameplayMain":8.5,"gameplayMainExtra":15,"gameplayCompletionist":35,"similarity":1,"searchTerm":"Resident Evil 2","playableOn":["Amazon Luna","Nintendo Switch","PC","PlayStation 4","PlayStation 5","Xbox One","Xbox Series X/S"]},{"id":"57335","name":"Disco Elysium","description":"DISCO ELYSIUM is a groundbreaking blend of hardboiled cop show and isometric RPG. Solve a massive, open ended case in a unique urban fantasy setting. Kick in doors, interrogate suspects, or just get lost exploring the gorgeously rendered city of Revachol. What kind of cop you are — is up to you.How long is Disco Elysium? When focusing on the main objectives, Disco Elysium is about 23 Hours in length. If you're a gamer that strives to see all aspects of the game, you are likely to spend around 46 Hours to obtain 100% completion.Platforms: Google Stadia, Mac, Nintendo Switch, PC, PlayStation 4, PlayStation 5, Xbox One, Xbox Series X/S","platforms":["Google Stadia","Mac","Nintendo Switch","PC","PlayStation 4","PlayStation 5","Xbox One","Xbox Series X/S"],"imageUrl":"https://howlongtobeat.com/games/57335_Disco_Elysium.jpg?width=760","timeLabels":[["gameplayMain","Main Story"],["gameplayMainExtra","Main + Sides"],["gameplayComplete","Completionist"]],"gameplayMain":23,"gameplayMainExtra":32.5,"gameplayCompletionist":46,"similarity":1,"searchTerm":"Disco Elysium","playableOn":["Google Stadia","Mac","Nintendo Switch","PC","PlayStation 4","PlayStation 5","Xbox One","Xbox Series X/S"]},{"id":"4247","name":"Half-Life","description":"The game follows the adventures of Gordon Freeman, a young research associate at the Black Mesa Federal Research Facility. A typical day at the office goes completely awry as numerous alien life forms invade the facility. The fate of the facility, and quite possibly the world, is in the hands of an unlikely hero.How long is Half-Life? When focusing on the main objectives, Half-Life is about 12 Hours in length. If you're a gamer that strives to see all aspects of the game, you are likely to spend around 15½ Hours to obtain 100% completion.","platforms":["Dreamcast","Linux","Mac","PC","PlayStation 2"],"imageUrl":"https://howlongtobeat.com/games/256px-Half-Life_Cover_Art.jpg?width=760","timeLabels":[["gameplayMain","Main Story"],["gameplayMainExtra","Main + Sides"],["gameplayComplete","Completionist"]],"gameplayMain":12,"gameplayMainExtra":14,"gameplayCompletionist":15.5,"similarity":1,"searchTerm":"Half-Life","playableOn":["Dreamcast","Linux","Mac","PC","PlayStation 2"]},{"id":"14996","name":"The Elder Scrolls V: Skyrim - Special Edition","description":"Winner of more than 200 Game of the Year Awards, Skyrim Special Edition brings the epic fantasy to life in stunning detail. The Special Edition includes the critically acclaimed game and add-ons with all-new features like remastered art and effects, volumetric god rays, dynamic depth of field, screen-space reflections, and more. Skyrim Special Edit ...Read Moreion also brings the full power of PC mods to consoles.  New quests, environments, characters, dialogue, armor, weapons and more – with Mods, there are no limits to what you can experience. How long is The Elder Scrolls V: Skyrim - Special Edition? When focusing on the main objectives, The Elder Scrolls V: Skyrim - Special Edition is about 26 Hours in length. If you're a gamer that strives to see all aspects of the game, you are likely to spend around 207 Hours to obtain 100% completion.Platforms: Nintendo Switch, PC, PlayStation 3, PlayStation 4, PlayStation 5, Xbox 360, Xbox One, Xbox Series X/S","platforms":["Nintendo Switch","PC","PlayStation 3","PlayStation 4","PlayStation 5","Xbox 360","Xbox One","Xbox Series X/S"],"imageUrl":"https://howlongtobeat.com/games/TheElderScrollsVSkyrimLegendaryEdition.jpg?width=760","timeLabels":[["gameplayMain","Main Story"],["gameplayMainExtra","Main + Sides"],["gameplayComplete","Completionist"]],"gameplayMain":26,"gameplayMainExtra":114,"gameplayCompletionist":207,"similarity":1,"searchTerm":"The Elder Scrolls V: Skyrim - Special Edition","playableOn":["Nintendo Switch","PC","PlayStation 3","PlayStation 4","PlayStation 5","Xbox 360","Xbox One","Xbox Series X/S"]},{"id":"60145","name":"Star Wars Jedi: Fallen Order","description":"A galaxy-spanning adventure awaits in STAR WARS Jedi: Fallen Order, a 3rd person action-adventure title from Respawn Entertainment. An abandoned Padawan must complete his training, develop new powerful Force abilities, and master the art of the lightsaber - all while staying one step ahead of the Empire.How long is Star Wars Jedi: Fallen Order? When focusing on the main objectives, Star Wars Jedi: Fallen Order is about 17 Hours in length. If you're a gamer that strives to see all aspects of the game, you are likely to spend around 31½ Hours to obtain 100% completion.Platforms: Google Stadia, PC, PlayStation 4, PlayStation 5, Xbox One, Xbox Series X/S","platforms":["Google Stadia","PC","PlayStation 4","PlayStation 5","Xbox One","Xbox Series X/S"],"imageUrl":"https://howlongtobeat.com/games/60145_Star_Wars_Jedi_Fallen_Order.jpg?width=760","timeLabels":[["gameplayMain","Main Story"],["gameplayMainExtra","Main + Sides"],["gameplayComplete","Completionist"]],"gameplayMain":17,"gameplayMainExtra":22,"gameplayCompletionist":31.5,"similarity":1,"searchTerm":"Star Wars Jedi: Fallen Order","playableOn":["Google Stadia","PC","PlayStation 4","PlayStation 5","Xbox One","Xbox Series X/S"]},{"id":"34716","name":"Stardew Valley","description":"You've inherited your grandfather's old farm plot in Stardew Valley. Armed with hand-me-down tools and a few coins, you set out to begin your new life. Can you learn to live off the land and turn these overgrown fields into a thriving home? It won't be easy. Ever since Joja Corporation came to town, the old ways of life have all but disappeared. Th ...Read Moree community center, once the town's most vibrant hub of activity, now lies in shambles. But the valley seems full of opportunity. With a little dedication, you might just be the one to restore Stardew Valley to greatness! How long is Stardew Valley? When focusing on the main objectives, Stardew Valley is about 53 Hours in length. If you're a gamer that strives to see all aspects of the game, you are likely to spend around 161 Hours to obtain 100% completion.Platforms: Linux, Mac, Mobile, Nintendo Switch, PC, PlayStation 4, PlayStation Vita, Xbox One","platforms":["Linux","Mac","Mobile","Nintendo Switch","PC","PlayStation 4","PlayStation Vita","Xbox One"],"imageUrl":"https://howlongtobeat.com/games/34716_Stardew_Valley.jpg?width=760","timeLabels":[["gameplayMain","Main Story"],["gameplayMainExtra","Main + Sides"],["gameplayComplete","Completionist"]],"gameplayMain":53,"gameplayMainExtra":90.5,"gameplayCompletionist":161,"similarity":1,"searchTerm":"Stardew Valley","playableOn":["Linux","Mac","Mobile","Nintendo Switch","PC","PlayStation 4","PlayStation Vita","Xbox One"]},{"id":"4248","name":"Half-Life 2","description":"Half-Life 2 delivers a new level of realistic action and excitement. Players return to the world of Gordon Freeman, as he returns to the Black Mesa research facility. The aliens are pouring into our world, and Freeman becomes part of a resistance group to stop them. New weapons, new enemies and new characters are waiting -- along with major enhance ...Read Morements in animation, artificial intelligence and graphics. How long is Half-Life 2? When focusing on the main objectives, Half-Life 2 is about 13 Hours in length. If you're a gamer that strives to see all aspects of the game, you are likely to spend around 19½ Hours to obtain 100% completion.","platforms":["Linux","Mac","Mobile","PC","PlayStation 3","Xbox","Xbox 360"],"imageUrl":"https://howlongtobeat.com/games/256px-421px-HL2box.jpg?width=760","timeLabels":[["gameplayMain","Main Story"],["gameplayMainExtra","Main + Sides"],["gameplayComplete","Completionist"]],"gameplayMain":13,"gameplayMainExtra":15.5,"gameplayCompletionist":19.5,"similarity":1,"searchTerm":"Half-Life 2","playableOn":["Linux","Mac","Mobile","PC","PlayStation 3","Xbox","Xbox 360"]},{"id":"41638","name":"Hellblade: Senua's Sacrifice","description":"From the makers of Heavenly Sword, Enslaved: Odyssey to the West, and DmC: Devil May Cry, comes a warrior’s brutal journey into myth and madness.\n\nSet in the Viking age, a broken Celtic warrior embarks on a haunting vision quest into Viking Hell to fight for the soul of her dead lover.","platforms":["Nintendo Switch","PC","PlayStation 4","Xbox One","Xbox Series X/S"],"imageUrl":"https://howlongtobeat.com/games/41638_Hellblade_Senuas_Sacrifice.jpg?width=760","timeLabels":[["gameplayMain","Main Story"],["gameplayMainExtra","Main + Sides"],["gameplayComplete","Completionist"]],"gameplayMain":7.5,"gameplayMainExtra":8,"gameplayCompletionist":9,"similarity":1,"searchTerm":"Hellblade: Senua's Sacrifice","playableOn":["Nintendo Switch","PC","PlayStation 4","Xbox One","Xbox Series X/S"]},"2024-01-26T04:18:43.817Z"]