[{"id":"129956","name":"Metaphor: ReFantazio","description":"The throne sits empty after the king’s assassination. With no heirs, the will of the late king decrees that the next monarch will be elected by the people, & thus begins your fight for the throne..How long is Metaphor: ReFantazio? When focusing on the main objectives, Metaphor: ReFantazio is about 65 Hours in length. If you're a gamer that strives to see all aspects of the game, you are likely to spend around 100 Hours to obtain 100% completion.","platforms":["PC","PlayStation 4","PlayStation 5","Xbox Series X/S"],"imageUrl":"https://howlongtobeat.com/games/129956_Metaphor_ReFantazio.jpg?width=760","timeLabels":[["gameplayMain","Main Story"],["gameplayMainExtra","Main + Sides"],["gameplayComplete","Completionist"]],"gameplayMain":65,"gameplayMainExtra":81,"gameplayCompletionist":100,"similarity":1,"searchTerm":"Metaphor: ReFantazio","playableOn":["PC","PlayStation 4","PlayStation 5","Xbox Series X/S"]},{"id":"114905","name":"Silent Hill 2","description":"\"My name...is Maria,\" the woman smiles. Her face, her voice... She's just like her.\n\nInvestigating a letter from his late wife, James returns to where they made so many memories - Silent Hill. What he finds is a ghost town, prowled by disturbing monsters and cloaked in deep fog. Confront the monsters, solve puzzles, and search for traces of your wi ...Read Morefe in this remake of SILENT HILL 2. How long is Silent Hill 2? When focusing on the main objectives, Silent Hill 2 is about 15½ Hours in length. If you're a gamer that strives to see all aspects of the game, you are likely to spend around 28½ Hours to obtain 100% completion.","platforms":["PC","PlayStation 5"],"imageUrl":"https://howlongtobeat.com/games/114905_Silent_Hill_2.jpg?width=760","timeLabels":[["gameplayMain","Main Story"],["gameplayMainExtra","Main + Sides"],["gameplayComplete","Completionist"]],"gameplayMain":15.5,"gameplayMainExtra":17.5,"gameplayCompletionist":28.5,"similarity":1,"searchTerm":"Silent Hill 2","playableOn":["PC","PlayStation 5"]},{"id":"151245","name":"Call of Duty: Black Ops 6","description":"Call of Duty: Black Ops 6 is signature Black Ops across a cinematic single-player Campaign, a best-in-class Multiplayer experience and with the epic return of Round-Based Zombies.How long is Call of Duty: Black Ops 6? When focusing on the main objectives, Call of Duty: Black Ops 6 is about 8 Hours in length. If you're a gamer that strives to see all aspects of the game, you are likely to spend around 11 Hours to obtain 100% completion.","platforms":["PC","PlayStation 4","PlayStation 5","Xbox One","Xbox Series X/S"],"imageUrl":"https://howlongtobeat.com/games/151245_Call_of_Duty_Black_Ops_6.jpg?width=760","timeLabels":[["gameplayMain","Main Story"],["gameplayMainExtra","Main + Sides"],["gameplayComplete","Completionist"]],"gameplayMain":8,"gameplayMainExtra":10.5,"gameplayCompletionist":11,"similarity":1,"searchTerm":"Call of Duty: Black Ops 6","playableOn":["PC","PlayStation 4","PlayStation 5","Xbox One","Xbox Series X/S"]},{"id":"68033","name":"Baldur's Gate 3","description":"An ancient evil has returned to Baldur's Gate, intent on devouring it from the inside out. The fate of Faerun lies in your hands. Alone, you may resist. But together, you can overcome.How long is Baldur's Gate 3? When focusing on the main objectives, Baldur's Gate 3 is about 69½ Hours in length. If you're a gamer that strives to see all aspects of the game, you are likely to spend around 164 Hours to obtain 100% completion.","platforms":["Mac","PC","PlayStation 5","Xbox Series X/S"],"imageUrl":"https://howlongtobeat.com/games/68033_Baldurs_Gate_3.jpg?width=760","timeLabels":[["gameplayMain","Main Story"],["gameplayMainExtra","Main + Sides"],["gameplayComplete","Completionist"]],"gameplayMain":69.5,"gameplayMainExtra":112,"gameplayCompletionist":164,"similarity":1,"searchTerm":"Baldur's Gate 3","playableOn":["Mac","PC","PlayStation 5","Xbox Series X/S"]},{"id":"68151","name":"Elden Ring","description":"The Golden Order has been broken. Rise, Tarnished, and be guided by grace to brandish the power of the Elden Ring and become an Elden Lord in the Lands Between. In the Lands Between ruled by Queen Marika the Eternal, the Elden Ring, the source of the Erdtree, has been shattered. Marika's offspring, demigods all, claimed the shards of the Elden Ring ...Read More known as the Great Runes, and the mad taint of their newfound strength triggered a war: The Shattering. A war that meant abandonment by the Greater Will. And now the guidance of grace will be brought to the Tarnished who were spurned by the grace of gold and exiled from the Lands Between. Ye dead who yet live, your grace long lost, follow the path to the Lands Between beyond the foggy sea to stand before the Elden Ring. And become the Elden Lord. How long is Elden Ring? When focusing on the main objectives, Elden Ring is about 59½ Hours in length. If you're a gamer that strives to see all aspects of the game, you are likely to spend around 133 Hours to obtain 100% completion.","platforms":["PC","PlayStation 4","PlayStation 5","Xbox One","Xbox Series X/S"],"imageUrl":"https://howlongtobeat.com/games/68151_Elden_Ring.jpg?width=760","timeLabels":[["gameplayMain","Main Story"],["gameplayMainExtra","Main + Sides"],["gameplayComplete","Completionist"]],"gameplayMain":59.5,"gameplayMainExtra":100,"gameplayCompletionist":133,"similarity":1,"searchTerm":"Elden Ring","playableOn":["PC","PlayStation 4","PlayStation 5","Xbox One","Xbox Series X/S"]},{"id":"27100","name":"Red Dead Redemption 2","description":"Red Dead Redemption 2 is an epic tale of life in America's unforgiving heartland. The game's vast and atmospheric world will also provide the foundation for a brand new online multiplayer experience.How long is Red Dead Redemption 2? When focusing on the main objectives, Red Dead Redemption 2 is about 50½ Hours in length. If you're a gamer that strives to see all aspects of the game, you are likely to spend around 187 Hours to obtain 100% completion.Genres: First-Person, Third-Person, Action, Adventure, Open World, Shooter","platforms":["Google Stadia","PC","PlayStation 4","Xbox One"],"imageUrl":"https://howlongtobeat.com/games/27100_Red_Dead_Redemption_2.jpg?width=760","timeLabels":[["gameplayMain","Main Story"],["gameplayMainExtra","Main + Sides"],["gameplayComplete","Completionist"]],"gameplayMain":50.5,"gameplayMainExtra":83,"gameplayCompletionist":187,"similarity":1,"searchTerm":"Red Dead Redemption 2","playableOn":["Google Stadia","PC","PlayStation 4","Xbox One"]},{"id":"2127","name":"Cyberpunk 2077","description":"Cyberpunk 2077 is an open-world, action-adventure story set in Night City, a megalopolis obsessed with power, glamour and body modification. You play as V, a mercenary outlaw going after a one-of-a-kind implant that is the key to immortality.How long is Cyberpunk 2077? When focusing on the main objectives, Cyberpunk 2077 is about 25½ Hours in length. If you're a gamer that strives to see all aspects of the game, you are likely to spend around 105 Hours to obtain 100% completion.Platforms: Google Stadia, PC, PlayStation 4, PlayStation 5, Xbox One, Xbox Series X/S","platforms":["Google Stadia","PC","PlayStation 4","PlayStation 5","Xbox One","Xbox Series X/S"],"imageUrl":"https://howlongtobeat.com/games/Cyberpunk-2077-2.jpg?width=760","timeLabels":[["gameplayMain","Main Story"],["gameplayMainExtra","Main + Sides"],["gameplayComplete","Completionist"]],"gameplayMain":25.5,"gameplayMainExtra":62.5,"gameplayCompletionist":105,"similarity":1,"searchTerm":"Cyberpunk 2077","playableOn":["Google Stadia","PC","PlayStation 4","PlayStation 5","Xbox One","Xbox Series X/S"]},{"id":"152370","name":"The Legend of Zelda: Echoes of Wisdom","description":"Save the kingdom of Hyrule – this time with the wisdom of Princess Zelda – in The Legend of Zelda: Echoes of Wisdom for Nintendo Switch.\n\nThe people of Hyrule are being stolen away by strange rifts that have appeared, and with a certain swordsman among those missing, it’s up to Princess Zelda to save her kingdom.How long is The Legend of Zelda: Echoes of Wisdom? When focusing on the main objectives, The Legend of Zelda: Echoes of Wisdom is about 20½ Hours in length. If you're a gamer that strives to see all aspects of the game, you are likely to spend around 33 Hours to obtain 100% completion.","platforms":[],"imageUrl":"https://howlongtobeat.com/games/152370_The_Legend_of_Zelda_Echoes_of_Wisdom.jpg?width=760","timeLabels":[["gameplayMain","Main Story"],["gameplayMainExtra","Main + Sides"],["gameplayComplete","Completionist"]],"gameplayMain":20.5,"gameplayMainExtra":26,"gameplayCompletionist":33,"similarity":1,"searchTerm":"The Legend of Zelda: Echoes of Wisdom","playableOn":[]},{"id":"82090","name":"Dragon Age: The Veilguard","description":"Welcome to Dragon Age: The Veilguard. Enter the world of Thedas, a vibrant land of rugged wilderness, treacherous labyrinths, and glittering cities – steeped in savage combat and secret magics. Now, the fate of this world teeters on a knife's edge.How long is Dragon Age: The Veilguard? When focusing on the main objectives, Dragon Age: The Veilguard is about 19½ Hours in length. If you're a gamer that strives to see all aspects of the game, you are likely to spend around 65 Hours to obtain 100% completion.","platforms":["PC","PlayStation 5","Xbox Series X/S"],"imageUrl":"https://howlongtobeat.com/games/82090_Dragon_Age_The_Veilguard.jpg?width=760","timeLabels":[["gameplayMain","Main Story"],["gameplayMainExtra","Main + Sides"],["gameplayComplete","Completionist"]],"gameplayMain":19.5,"gameplayMainExtra":52.5,"gameplayCompletionist":65,"similarity":1,"searchTerm":"Dragon Age: The Veilguard","playableOn":["PC","PlayStation 5","Xbox Series X/S"]},{"id":"7231","name":"Portal 2","description":"Portal 2 draws from the award-winning formula of innovative gameplay, story, and music that earned the original Portal over 70 industry accolades and created a cult following.\n\nThe single-player portion of Portal 2 introduces a cast of dynamic new characters, a host of fresh puzzle elements, and a much larger set of devious test chambers. Players ...Read More will explore never-before-seen areas of the Aperture Science Labs and be reunited with GLaDOS, the occasionally murderous computer companion who guided them through the original game.\n\nThe game’s two-player cooperative mode features its own entirely separate campaign with a unique story, test chambers, and two new player characters. This new mode forces players to reconsider everything they thought they knew about portals. Success will require them to not just act cooperatively, but to think cooperatively. How long is Portal 2? When focusing on the main objectives, Portal 2 is about 8½ Hours in length. If you're a gamer that strives to see all aspects of the game, you are likely to spend around 22 Hours to obtain 100% completion.","platforms":["Linux","Mac","Nintendo Switch","PC","PlayStation 3","Xbox 360"],"imageUrl":"https://howlongtobeat.com/games/Portal2cover.jpg?width=760","timeLabels":[["gameplayMain","Main Story"],["gameplayMainExtra","Main + Sides"],["gameplayComplete","Completionist"]],"gameplayMain":8.5,"gameplayMainExtra":13.5,"gameplayCompletionist":22,"similarity":1,"searchTerm":"Portal 2","playableOn":["Linux","Mac","Nintendo Switch","PC","PlayStation 3","Xbox 360"]},{"id":"10270","name":"The Witcher 3: Wild Hunt","description":"In The Witcher 3 an ancient evil stirs, awakening. An evil that sows terror and abducts the young. An evil whose name is spoken only in whispers: the Wild Hunt. Led by four wraith commanders, this ravenous band of phantoms is the ultimate predator and has been for centuries. Its quarry: humans.How long is The Witcher 3: Wild Hunt? When focusing on the main objectives, The Witcher 3: Wild Hunt is about 51½ Hours in length. If you're a gamer that strives to see all aspects of the game, you are likely to spend around 174 Hours to obtain 100% completion.Platforms: Nintendo Switch, PC, PlayStation 4, PlayStation 5, Xbox One, Xbox Series X/S","platforms":["Nintendo Switch","PC","PlayStation 4","PlayStation 5","Xbox One","Xbox Series X/S"],"imageUrl":"https://howlongtobeat.com/games/10270_The_Witcher_3_Wild_Hunt.jpg?width=760","timeLabels":[["gameplayMain","Main Story"],["gameplayMainExtra","Main + Sides"],["gameplayComplete","Completionist"]],"gameplayMain":51.5,"gameplayMainExtra":103,"gameplayCompletionist":174,"similarity":1,"searchTerm":"The Witcher 3: Wild Hunt","playableOn":["Nintendo Switch","PC","PlayStation 4","PlayStation 5","Xbox One","Xbox Series X/S"]},{"id":"7230","name":"Portal","description":"Portal is a new single player game from Valve, creators of Half-Life 2 and Counter-Strike. Set in the mysterious Aperture Science Laboratories, Portal has earned over 15 Game of the Year Awards and offers gamers hours of unique gameplay. The game is designed to change the way players approach, manipulate and surmise the possibilities in a given env ...Read Moreironment; similar to how Half-Life 2's Gravity Gun innovated new ways to leverage an object in any given situation. Players must solve physical puzzles and challenges by opening portals to maneuvering objects, and themselves, through space. How long is Portal? When focusing on the main objectives, Portal is about 3 Hours in length. If you're a gamer that strives to see all aspects of the game, you are likely to spend around 10 Hours to obtain 100% completion.","platforms":["Linux","Mac","Nintendo Switch","PC","PlayStation 3","Xbox 360"],"imageUrl":"https://howlongtobeat.com/games/256px-Portal_standalonebox.jpg?width=760","timeLabels":[["gameplayMain","Main Story"],["gameplayMainExtra","Main + Sides"],["gameplayComplete","Completionist"]],"gameplayMain":3,"gameplayMainExtra":5,"gameplayCompletionist":10,"similarity":1,"searchTerm":"Portal","playableOn":["Linux","Mac","Nintendo Switch","PC","PlayStation 3","Xbox 360"]},{"id":"4064","name":"Grand Theft Auto V","description":"Developed by series creator Rockstar North, Grand Theft Auto V is the largest and most ambitious title in the series to date. Set in the sprawling city of Los Santos and the surrounding area, Grand Theft Auto V delivers a world of unprecedented scale and detail bursting with life, from mountaintops to the depths of the ocean.How long is Grand Theft Auto V? When focusing on the main objectives, Grand Theft Auto V is about 32 Hours in length. If you're a gamer that strives to see all aspects of the game, you are likely to spend around 85½ Hours to obtain 100% completion.Platforms: PC, PlayStation 3, PlayStation 4, PlayStation 5, Xbox 360, Xbox One, Xbox Series X/SGenres: First-Person, Third-Person, Action, Open World, Racing/Driving, Shooter","platforms":["PC","PlayStation 3","PlayStation 4","PlayStation 5","Xbox 360","Xbox One","Xbox Series X/S"],"imageUrl":"https://howlongtobeat.com/games/4064_Grand_Theft_Auto_V.jpg?width=760","timeLabels":[["gameplayMain","Main Story"],["gameplayMainExtra","Main + Sides"],["gameplayComplete","Completionist"]],"gameplayMain":32,"gameplayMainExtra":50.5,"gameplayCompletionist":85.5,"similarity":1,"searchTerm":"Grand Theft Auto V","playableOn":["PC","PlayStation 3","PlayStation 4","PlayStation 5","Xbox 360","Xbox One","Xbox Series X/S"]},{"id":"10469","name":"Tomb Raider","description":"After a brutal storm destroys the boat she was travelling on, a frightened young woman is left washed ashore on an unknown beach. On her own but not alone she has only one goal, to survive. Here begins the first adventure for a young and inexperienced Lara Croft in a story which charts the journey of an ordinary woman who finds out just how far she ...Read More must go in order to stay alive. How long is Tomb Raider? When focusing on the main objectives, Tomb Raider is about 11½ Hours in length. If you're a gamer that strives to see all aspects of the game, you are likely to spend around 21 Hours to obtain 100% completion.Platforms: Google Stadia, Linux, Mac, PC, PlayStation 3, PlayStation 4, Xbox 360, Xbox OneDevelopers: Crystal Dynamics, Eidos Montreal, Nixxes Software BV, United Front Games","platforms":["Google Stadia","Linux","Mac","PC","PlayStation 3","PlayStation 4","Xbox 360","Xbox One"],"imageUrl":"https://howlongtobeat.com/games/256px-Tr2011cover.jpg?width=760","timeLabels":[["gameplayMain","Main Story"],["gameplayMainExtra","Main + Sides"],["gameplayComplete","Completionist"]],"gameplayMain":11.5,"gameplayMainExtra":15.5,"gameplayCompletionist":21,"similarity":1,"searchTerm":"Tomb Raider","playableOn":["Google Stadia","Linux","Mac","PC","PlayStation 3","PlayStation 4","Xbox 360","Xbox One"]},{"id":"38050","name":"God of War","description":"His vengeance against the Gods of Olympus years behind him, Kratos now lives as a man in the realm of Norse Gods and monsters. It is in this harsh, unforgiving world that he must fight to survive… and teach his son to do the same.How long is God of War? When focusing on the main objectives, God of War is about 20½ Hours in length. If you're a gamer that strives to see all aspects of the game, you are likely to spend around 51 Hours to obtain 100% completion.","platforms":["PC","PlayStation 4"],"imageUrl":"https://howlongtobeat.com/games/38050_God_of_War.jpg?width=760","timeLabels":[["gameplayMain","Main Story"],["gameplayMainExtra","Main + Sides"],["gameplayComplete","Completionist"]],"gameplayMain":20.5,"gameplayMainExtra":33,"gameplayCompletionist":51,"similarity":1,"searchTerm":"God of War","playableOn":["PC","PlayStation 4"]},{"id":"1065","name":"BioShock","description":"BioShock is a shooter unlike any you've ever played, loaded with weapons and tactics never seen. You'll have a complete arsenal at your disposal from simple revolvers to grenade launchers and chemical throwers, but you'll also be forced to genetically modify your DNA to create an even more deadly weapon: you. Injectable plasmids give you super huma ...Read Moren powers: blast electrical currents into water to electrocute multiple enemies, or freeze them solid and obliterate them with the swing of a wrench.\n\nNo encounter ever plays out the same, and no two gamers will play the game the same way. How long is BioShock? When focusing on the main objectives, BioShock is about 12 Hours in length. If you're a gamer that strives to see all aspects of the game, you are likely to spend around 23 Hours to obtain 100% completion.Platforms: Mobile, Nintendo Switch, OnLive, PC, PlayStation 3, PlayStation 4, Xbox 360, Xbox One","platforms":["Mobile","Nintendo Switch","OnLive","PC","PlayStation 3","PlayStation 4","Xbox 360","Xbox One"],"imageUrl":"https://howlongtobeat.com/games/Bioshockcoverfinalcropped.jpg?width=760","timeLabels":[["gameplayMain","Main Story"],["gameplayMainExtra","Main + Sides"],["gameplayComplete","Completionist"]],"gameplayMain":12,"gameplayMainExtra":15.5,"gameplayCompletionist":23,"similarity":1,"searchTerm":"BioShock","playableOn":["Mobile","Nintendo Switch","OnLive","PC","PlayStation 3","PlayStation 4","Xbox 360","Xbox One"]},{"id":"26286","name":"Hollow Knight","description":"Hollow Knight is a challenging, beautiful action adventure game set in the vast, inter-connected underground kingdom of Hallownest. A 2D action game with an emphasis on skill and exploration, Hollow Knight has you fighting a fearsome host of deadly creatures, avoiding intricate traps and solving ancient mysteries as you make your own way through fu ...Read Morengal wastes, forests of bone, and ruined underground cities. How long is Hollow Knight? When focusing on the main objectives, Hollow Knight is about 27 Hours in length. If you're a gamer that strives to see all aspects of the game, you are likely to spend around 64 Hours to obtain 100% completion.","platforms":["Linux","Mac","Nintendo Switch","PC","PlayStation 4","Xbox One"],"imageUrl":"https://howlongtobeat.com/games/Hollow_Knight_collection_branding.jpg?width=760","timeLabels":[["gameplayMain","Main Story"],["gameplayMainExtra","Main + Sides"],["gameplayComplete","Completionist"]],"gameplayMain":27,"gameplayMainExtra":41.5,"gameplayCompletionist":64,"similarity":1,"searchTerm":"Hollow Knight","playableOn":["Linux","Mac","Nintendo Switch","PC","PlayStation 4","Xbox One"]},{"id":"62941","name":"Hades","description":"Defy the god of death as you hack and slash your way out of the Underworld in this rogue-like dungeon crawler from the creators of Bastion and Transistor.How long is Hades? When focusing on the main objectives, Hades is about 23 Hours in length. If you're a gamer that strives to see all aspects of the game, you are likely to spend around 95 Hours to obtain 100% completion.Platforms: Mac, Mobile, Nintendo Switch, PC, PlayStation 4, PlayStation 5, Xbox One, Xbox Series X/S","platforms":["Mac","Mobile","Nintendo Switch","PC","PlayStation 4","PlayStation 5","Xbox One","Xbox Series X/S"],"imageUrl":"https://howlongtobeat.com/games/62941_Hades.jpg?width=760","timeLabels":[["gameplayMain","Main Story"],["gameplayMainExtra","Main + Sides"],["gameplayComplete","Completionist"]],"gameplayMain":23,"gameplayMainExtra":48.5,"gameplayCompletionist":95,"similarity":1,"searchTerm":"Hades","playableOn":["Mac","Mobile","Nintendo Switch","PC","PlayStation 4","PlayStation 5","Xbox One","Xbox Series X/S"]},{"id":"34716","name":"Stardew Valley","description":"You've inherited your grandfather's old farm plot in Stardew Valley. Armed with hand-me-down tools and a few coins, you set out to begin your new life. Can you learn to live off the land and turn these overgrown fields into a thriving home? It won't be easy. Ever since Joja Corporation came to town, the old ways of life have all but disappeared. Th ...Read Moree community center, once the town's most vibrant hub of activity, now lies in shambles. But the valley seems full of opportunity. With a little dedication, you might just be the one to restore Stardew Valley to greatness! How long is Stardew Valley? When focusing on the main objectives, Stardew Valley is about 53½ Hours in length. If you're a gamer that strives to see all aspects of the game, you are likely to spend around 167 Hours to obtain 100% completion.Platforms: Linux, Mac, Mobile, Nintendo Switch, PC, PlayStation 4, PlayStation Vita, Xbox One","platforms":["Linux","Mac","Mobile","Nintendo Switch","PC","PlayStation 4","PlayStation Vita","Xbox One"],"imageUrl":"https://howlongtobeat.com/games/34716_Stardew_Valley.jpg?width=760","timeLabels":[["gameplayMain","Main Story"],["gameplayMainExtra","Main + Sides"],["gameplayComplete","Completionist"]],"gameplayMain":53.5,"gameplayMainExtra":93.5,"gameplayCompletionist":167,"similarity":1,"searchTerm":"Stardew Valley","playableOn":["Linux","Mac","Mobile","Nintendo Switch","PC","PlayStation 4","PlayStation Vita","Xbox One"]},{"id":"57335","name":"Disco Elysium","description":"DISCO ELYSIUM is a groundbreaking blend of hardboiled cop show and isometric RPG. Solve a massive, open ended case in a unique urban fantasy setting. Kick in doors, interrogate suspects, or just get lost exploring the gorgeously rendered city of Revachol. What kind of cop you are — is up to you.How long is Disco Elysium? When focusing on the main objectives, Disco Elysium is about 23½ Hours in length. If you're a gamer that strives to see all aspects of the game, you are likely to spend around 46½ Hours to obtain 100% completion.Platforms: Google Stadia, Mac, Nintendo Switch, PC, PlayStation 4, PlayStation 5, Xbox One, Xbox Series X/S","platforms":["Google Stadia","Mac","Nintendo Switch","PC","PlayStation 4","PlayStation 5","Xbox One","Xbox Series X/S"],"imageUrl":"https://howlongtobeat.com/games/57335_Disco_Elysium.jpg?width=760","timeLabels":[["gameplayMain","Main Story"],["gameplayMainExtra","Main + Sides"],["gameplayComplete","Completionist"]],"gameplayMain":23.5,"gameplayMainExtra":33,"gameplayCompletionist":46.5,"similarity":1,"searchTerm":"Disco Elysium","playableOn":["Google Stadia","Mac","Nintendo Switch","PC","PlayStation 4","PlayStation 5","Xbox One","Xbox Series X/S"]},{"id":"83146","name":"God of War: Ragnarök","description":"From Santa Monica Studio comes the sequel to the critically acclaimed God of War (2018). Kratos and Atreus must journey to each of the Nine Realms in search of answers as they prepare for the prophesied battle that will end the world.\n\nTogether, Kratos and Atreus venture deep into the Nine Realms in search of answers as Asgardian forces prepare f ...Read Moreor war. Along the way they will explore stunning, mythical landscapes, gather allies from across the realms and face fearsome enemies in the form of Norse gods and monsters.\n\nAs the threat of Ragnarök grows ever closer, Kratos and Atreus find themselves choosing between the safety of their family and the safety of the realms... How long is God of War: Ragnarök? When focusing on the main objectives, God of War: Ragnarök is about 26½ Hours in length. If you're a gamer that strives to see all aspects of the game, you are likely to spend around 54½ Hours to obtain 100% completion.","platforms":["PC","PlayStation 4","PlayStation 5"],"imageUrl":"https://howlongtobeat.com/games/83146_God_of_War_Ragnark.jpg?width=760","timeLabels":[["gameplayMain","Main Story"],["gameplayMainExtra","Main + Sides"],["gameplayComplete","Completionist"]],"gameplayMain":26.5,"gameplayMainExtra":40.5,"gameplayCompletionist":54.5,"similarity":1,"searchTerm":"God of War: Ragnarök","playableOn":["PC","PlayStation 4","PlayStation 5"]},{"id":"57479","name":"Resident Evil 2","description":"A deadly virus engulfs the residents of Raccoon City in September of 1998, plunging the city into chaos as flesh eating zombies roam the streets for survivors. An unparalleled adrenaline rush, gripping storyline, and unimaginable horrors await you. Witness the return of Resident Evil 2.How long is Resident Evil 2? When focusing on the main objectives, Resident Evil 2 is about 9 Hours in length. If you're a gamer that strives to see all aspects of the game, you are likely to spend around 36 Hours to obtain 100% completion.Platforms: Amazon Luna, Nintendo Switch, PC, PlayStation 4, PlayStation 5, Xbox One, Xbox Series X/S","platforms":["Amazon Luna","Nintendo Switch","PC","PlayStation 4","PlayStation 5","Xbox One","Xbox Series X/S"],"imageUrl":"https://howlongtobeat.com/games/57479_Resident_Evil_2.jpg?width=760","timeLabels":[["gameplayMain","Main Story"],["gameplayMainExtra","Main + Sides"],["gameplayComplete","Completionist"]],"gameplayMain":9,"gameplayMainExtra":15.5,"gameplayCompletionist":36,"similarity":1,"searchTerm":"Resident Evil 2","playableOn":["Amazon Luna","Nintendo Switch","PC","PlayStation 4","PlayStation 5","Xbox One","Xbox Series X/S"]},{"id":"14443","name":"Batman: Arkham Asylum GOTY","description":"Critically acclaimed Batman: Arkum Asylum returns with a remastered Game of the Year Edition, featuring 4 extra Challenge Maps. The additional Challenge Maps include Crime Alley, Scarecrow Nightmare, Totally Insane and Nocturnal Hunter (both from the Insane Night Map Pack.)How long is Batman: Arkham Asylum GOTY? When focusing on the main objectives, Batman: Arkham Asylum GOTY is about 11 Hours in length. If you're a gamer that strives to see all aspects of the game, you are likely to spend around 25 Hours to obtain 100% completion.","platforms":["PC","PlayStation 3","Xbox 360"],"imageUrl":"https://howlongtobeat.com/games/Batman_Arkham_Asylum_GOTY.jpg?width=760","timeLabels":[["gameplayMain","Main Story"],["gameplayMainExtra","Main + Sides"],["gameplayComplete","Completionist"]],"gameplayMain":11,"gameplayMainExtra":15.5,"gameplayCompletionist":25,"similarity":1,"searchTerm":"Batman: Arkham Asylum GOTY","playableOn":["PC","PlayStation 3","Xbox 360"]},{"id":"83145","name":"Hogwarts Legacy","description":"Experience Hogwarts in the 1800s. Your character is a student who holds the key to an ancient secret that threatens to tear the wizarding world apart. Make allies, battle Dark wizards and decide the fate of the wizarding world.How long is Hogwarts Legacy? When focusing on the main objectives, Hogwarts Legacy is about 26½ Hours in length. If you're a gamer that strives to see all aspects of the game, you are likely to spend around 70 Hours to obtain 100% completion.Platforms: Nintendo Switch, PC, PlayStation 4, PlayStation 5, Xbox One, Xbox Series X/S","platforms":["Nintendo Switch","PC","PlayStation 4","PlayStation 5","Xbox One","Xbox Series X/S"],"imageUrl":"https://howlongtobeat.com/games/83145_Hogwarts_Legacy.jpg?width=760","timeLabels":[["gameplayMain","Main Story"],["gameplayMainExtra","Main + Sides"],["gameplayComplete","Completionist"]],"gameplayMain":26.5,"gameplayMainExtra":44.5,"gameplayCompletionist":70,"similarity":1,"searchTerm":"Hogwarts Legacy","playableOn":["Nintendo Switch","PC","PlayStation 4","PlayStation 5","Xbox One","Xbox Series X/S"]},{"id":"2708","name":"Doom","description":"You've come here for a reason. The Union Aerospace Corporation's massive research facility on Mars is overwhelmed by fierce and powerful demons, and only one person stands between their world and ours. As the lone DOOM Marine, you've been activated to do one thing: kill them all.How long is Doom? When focusing on the main objectives, Doom is about 11½ Hours in length. If you're a gamer that strives to see all aspects of the game, you are likely to spend around 27 Hours to obtain 100% completion.","platforms":["Google Stadia","Nintendo Switch","PC","PlayStation 4","Xbox One"],"imageUrl":"https://howlongtobeat.com/games/doom_2016.jpg?width=760","timeLabels":[["gameplayMain","Main Story"],["gameplayMainExtra","Main + Sides"],["gameplayComplete","Completionist"]],"gameplayMain":11.5,"gameplayMainExtra":16.5,"gameplayCompletionist":27,"similarity":1,"searchTerm":"Doom","playableOn":["Google Stadia","Nintendo Switch","PC","PlayStation 4","Xbox One"]},"2024-11-11T00:04:12.944Z"]